// Реализовать простой калькулятор (+ - / *)
// Ввод числа ->
// Ввод знака ->
// Ввод числа ->


public class task07 {
    public static void main(String[] args) {
        

    System.out.println("Реализовать простой калькулятор (+ - / *)");
    int a =input.Int("Введите число a");
    int znak =input.Int("Арифметическое действие");
    int b =input.Int("Введите число b ");

    }
    
}
